---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures
source: html/a3d691c9-5f8f-29ca-cfad-fa1d1d66f203.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures

Failures about CurtainWall.

## Syntax (C#)
```csharp
public static class CurtainWallFailures
```